Table of Contents
 Class ProjectDataConcrete
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Project data concrete
public abstract class ProjectDataConcrete : OpenObject
Inheritance
object
OpenObject
ProjectDataConcrete
Derived
ProjectDataConcreteEc2
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ProjectDataConcrete()
Constructor
public ProjectDataConcrete()
Properties
 DesignWorkingLife
Design working fife
public int DesignWorkingLife { get; set; }
Property Value
int
 Edit this page